analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/adc_regs.h
/**
 * @file    adc_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the ADC Peripheral Module.
 * @note    This file is @generated.
 * @ingroup adc_registers
 */

/******************************************************************************
/******************************************************************************
 *
 * Copyright (C) 2022-2023 Maxim Integrated Products, Inc. All Rights Reserved.
 * (now owned by Analog Devices, Inc.),
 * Copyright (C) 2023 Analog Devices, Inc. All Rights Reserved. This software
 * is proprietary to Analog Devices, Inc. and its licensors.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_ADC_REGS_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_ADC_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__ICCARM__)
  #pragma system_include
#endif

#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     adc
 * @defgroup    adc_registers ADC_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the ADC Peripheral Module.
 * @details     10-bit Analog to Digital Converter
 */

/**
 * @ingroup adc_registers
 * Structure type to access the ADC Registers.
 */
typedef struct {
    __IO uint32_t ctrl;                 /**< <tt>\b 0x0000:</tt> ADC CTRL Register */
    __IO uint32_t status;               /**< <tt>\b 0x0004:</tt> ADC STATUS Register */
    __IO uint32_t data;                 /**< <tt>\b 0x0008:</tt> ADC DATA Register */
    __IO uint32_t intr;                 /**< <tt>\b 0x000C:</tt> ADC INTR Register */
    __IO uint32_t limit[4];             /**< <tt>\b 0x0010:</tt> ADC LIMIT Register */
} mxc_adc_regs_t;

/* Register offsets for module ADC */
/**
 * @ingroup    adc_registers
 * @defgroup   ADC_Register_Offsets Register Offsets
 * @brief      ADC Peripheral Register Offsets from the ADC Base Peripheral Address.
 * @{
 */
#define MXC_R_ADC_CTRL                     ((uint32_t)0x00000000UL) /**< Offset from ADC Base Address: <tt> 0x0000</tt> */
#define MXC_R_ADC_STATUS                   ((uint32_t)0x00000004UL) /**< Offset from ADC Base Address: <tt> 0x0004</tt> */
#define MXC_R_ADC_DATA                     ((uint32_t)0x00000008UL) /**< Offset from ADC Base Address: <tt> 0x0008</tt> */
#define MXC_R_ADC_INTR                     ((uint32_t)0x0000000CUL) /**< Offset from ADC Base Address: <tt> 0x000C</tt> */
#define MXC_R_ADC_LIMIT                    ((uint32_t)0x00000010UL) /**< Offset from ADC Base Address: <tt> 0x0010</tt> */
/**@} end of group adc_registers */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_CTRL ADC_CTRL
 * @brief    ADC Control
 * @{
 */
#define MXC_F_ADC_CTRL_START_POS                       0 /**< CTRL_START Position */
#define MXC_F_ADC_CTRL_START                           ((uint32_t)(0x1UL << MXC_F_ADC_CTRL_START_POS)) /**< CTRL_START Mask */
#define MXC_V_ADC_CTRL_START_INACTIVE                  ((uint32_t)0x0UL) /**< CTRL_START_INACTIVE Value */
#define MXC_S_ADC_CTRL_START_INACTIVE                  (MXC_V_ADC_CTRL_START_INACTIVE << MXC_F_ADC_CTRL_START_POS) /**< CTRL_START_INACTIVE Setting */
#define MXC_V_ADC_CTRL_START_START                     ((uint32_t)0x1UL) /**< CTRL_START_START Value */
#define MXC_S_ADC_CTRL_START_START                     (MXC_V_ADC_CTRL_START_START << MXC_F_ADC_CTRL_START_POS) /**< CTRL_START_START Setting */

#define MXC_F_ADC_CTRL_PWR_POS                         1 /**< CTRL_PWR Position */
#define MXC_F_ADC_CTRL_PWR                             ((uint32_t)(0x1UL << MXC_F_ADC_CTRL_PWR_POS)) /**< CTRL_PWR Mask */
#define MXC_V_ADC_CTRL_PWR_ADC_OFF                     ((uint32_t)0x0UL) /**< CTRL_PWR_ADC_OFF Value */
#define MXC_S_ADC_CTRL_PWR_ADC_OFF                     (MXC_V_ADC_CTRL_PWR_ADC_OFF << MXC_F_ADC_CTRL_PWR_POS) /**< CTRL_PWR_ADC_OFF Setting */
#define MXC_V_ADC_CTRL_PWR_ADC_ON                      ((uint32_t)0x1UL) /**< CTRL_PWR_ADC_ON Value */
#define MXC_S_ADC_CTRL_PWR_ADC_ON                      (MXC_V_ADC_CTRL_PWR_ADC_ON << MXC_F_ADC_CTRL_PWR_POS) /**< CTRL_PWR_ADC_ON Setting */

#define MXC_F_ADC_CTRL_REFBUF_PWR_POS                  3 /**< CTRL_REFBUF_PWR Position */
#define MXC_F_ADC_CTRL_REFBUF_PWR                      ((uint32_t)(0x1UL << MXC_F_ADC_CTRL_REFBUF_PWR_POS)) /**< CTRL_REFBUF_PWR Mask */
#define MXC_V_ADC_CTRL_REFBUF_PWR_REFBUF_OFF           ((uint32_t)0x0UL) /**< CTRL_REFBUF_PWR_REFBUF_OFF Value */
#define MXC_S_ADC_CTRL_REFBUF_PWR_REFBUF_OFF           (MXC_V_ADC_CTRL_REFBUF_PWR_REFBUF_OFF << MXC_F_ADC_CTRL_REFBUF_PWR_POS) /**< CTRL_REFBUF_PWR_REFBUF_OFF Setting */
#define MXC_V_ADC_CTRL_REFBUF_PWR_REFBUF_ON            ((uint32_t)0x1UL) /**< CTRL_REFBUF_PWR_REFBUF_ON Value */
#define MXC_S_ADC_CTRL_REFBUF_PWR_REFBUF_ON            (MXC_V_ADC_CTRL_REFBUF_PWR_REFBUF_ON << MXC_F_ADC_CTRL_REFBUF_PWR_POS) /**< CTRL_REFBUF_PWR_REFBUF_ON Setting */

#define MXC_F_ADC_CTRL_REF_SEL_POS                     4 /**< CTRL_REF_SEL Position */
#define MXC_F_ADC_CTRL_REF_SEL                         ((uint32_t)(0x1UL << MXC_F_ADC_CTRL_REF_SEL_POS)) /**< CTRL_REF_SEL Mask */
#define MXC_V_ADC_CTRL_REF_SEL_BANDGAP                 ((uint32_t)0x0UL) /**< CTRL_REF_SEL_BANDGAP Value */
#define MXC_S_ADC_CTRL_REF_SEL_BANDGAP                 (MXC_V_ADC_CTRL_REF_SEL_BANDGAP << MXC_F_ADC_CTRL_REF_SEL_POS) /**< CTRL_REF_SEL_BANDGAP Setting */
#define MXC_V_ADC_CTRL_REF_SEL_VDD_DIV2                ((uint32_t)0x1UL) /**< CTRL_REF_SEL_VDD_DIV2 Value */
#define MXC_S_ADC_CTRL_REF_SEL_VDD_DIV2                (MXC_V_ADC_CTRL_REF_SEL_VDD_DIV2 << MXC_F_ADC_CTRL_REF_SEL_POS) /**< CTRL_REF_SEL_VDD_DIV2 Setting */

#define MXC_F_ADC_CTRL_REF_SCALE_POS                   8 /**< CTRL_REF_SCALE Position */
#define MXC_F_ADC_CTRL_REF_SCALE                       ((uint32_t)(0x1UL << MXC_F_ADC_CTRL_REF_SCALE_POS)) /**< CTRL_REF_SCALE Mask */
#define MXC_V_ADC_CTRL_REF_SCALE_DIV1                  ((uint32_t)0x0UL) /**< CTRL_REF_SCALE_DIV1 Value */
#define MXC_S_ADC_CTRL_REF_SCALE_DIV1                  (MXC_V_ADC_CTRL_REF_SCALE_DIV1 << MXC_F_ADC_CTRL_REF_SCALE_POS) /**< CTRL_REF_SCALE_DIV1 Setting */
#define MXC_V_ADC_CTRL_REF_SCALE_DIV2                  ((uint32_t)0x1UL) /**< CTRL_REF_SCALE_DIV2 Value */
#define MXC_S_ADC_CTRL_REF_SCALE_DIV2                  (MXC_V_ADC_CTRL_REF_SCALE_DIV2 << MXC_F_ADC_CTRL_REF_SCALE_POS) /**< CTRL_REF_SCALE_DIV2 Setting */

#define MXC_F_ADC_CTRL_INPUT_SCALE_POS                 9 /**< CTRL_INPUT_SCALE Position */
#define MXC_F_ADC_CTRL_INPUT_SCALE                     ((uint32_t)(0x1UL << MXC_F_ADC_CTRL_INPUT_SCALE_POS)) /**< CTRL_INPUT_SCALE Mask */
#define MXC_V_ADC_CTRL_INPUT_SCALE_DIV1                ((uint32_t)0x0UL) /**< CTRL_INPUT_SCALE_DIV1 Value */
#define MXC_S_ADC_CTRL_INPUT_SCALE_DIV1                (MXC_V_ADC_CTRL_INPUT_SCALE_DIV1 << MXC_F_ADC_CTRL_INPUT_SCALE_POS) /**< CTRL_INPUT_SCALE_DIV1 Setting */
#define MXC_V_ADC_CTRL_INPUT_SCALE_DIV2                ((uint32_t)0x1UL) /**< CTRL_INPUT_SCALE_DIV2 Value */
#define MXC_S_ADC_CTRL_INPUT_SCALE_DIV2                (MXC_V_ADC_CTRL_INPUT_SCALE_DIV2 << MXC_F_ADC_CTRL_INPUT_SCALE_POS) /**< CTRL_INPUT_SCALE_DIV2 Setting */

#define MXC_F_ADC_CTRL_CLK_EN_POS                      11 /**< CTRL_CLK_EN Position */
#define MXC_F_ADC_CTRL_CLK_EN                          ((uint32_t)(0x1UL << MXC_F_ADC_CTRL_CLK_EN_POS)) /**< CTRL_CLK_EN Mask */
#define MXC_V_ADC_CTRL_CLK_EN_DIS                      ((uint32_t)0x0UL) /**< CTRL_CLK_EN_DIS Value */
#define MXC_S_ADC_CTRL_CLK_EN_DIS                      (MXC_V_ADC_CTRL_CLK_EN_DIS << MXC_F_ADC_CTRL_CLK_EN_POS) /**< CTRL_CLK_EN_DIS Setting */
#define MXC_V_ADC_CTRL_CLK_EN_EN                       ((uint32_t)0x1UL) /**< CTRL_CLK_EN_EN Value */
#define MXC_S_ADC_CTRL_CLK_EN_EN                       (MXC_V_ADC_CTRL_CLK_EN_EN << MXC_F_ADC_CTRL_CLK_EN_POS) /**< CTRL_CLK_EN_EN Setting */

#define MXC_F_ADC_CTRL_CH_SEL_POS                      12 /**< CTRL_CH_SEL Position */
#define MXC_F_ADC_CTRL_CH_SEL                          ((uint32_t)(0xFUL << MXC_F_ADC_CTRL_CH_SEL_POS)) /**< CTRL_CH_SEL Mask */
#define MXC_V_ADC_CTRL_CH_SEL_AIN0                     ((uint32_t)0x0UL) /**< CTRL_CH_SEL_AIN0 Value */
#define MXC_S_ADC_CTRL_CH_SEL_AIN0                     (MXC_V_ADC_CTRL_CH_SEL_AIN0 << MXC_F_ADC_CTRL_CH_SEL_POS) /**< CTRL_CH_SEL_AIN0 Setting */
#define MXC_V_ADC_CTRL_CH_SEL_AIN1                     ((uint32_t)0x1UL) /**< CTRL_CH_SEL_AIN1 Value */
#define MXC_S_ADC_CTRL_CH_SEL_AIN1                     (MXC_V_ADC_CTRL_CH_SEL_AIN1 << MXC_F_ADC_CTRL_CH_SEL_POS) /**< CTRL_CH_SEL_AIN1 Setting */
#define MXC_V_ADC_CTRL_CH_SEL_AIN2                     ((uint32_t)0x2UL) /**< CTRL_CH_SEL_AIN2 Value */
#define MXC_S_ADC_CTRL_CH_SEL_AIN2                     (MXC_V_ADC_CTRL_CH_SEL_AIN2 << MXC_F_ADC_CTRL_CH_SEL_POS) /**< CTRL_CH_SEL_AIN2 Setting */
#define MXC_V_ADC_CTRL_CH_SEL_AIN3                     ((uint32_t)0x3UL) /**< CTRL_CH_SEL_AIN3 Value */
#define MXC_S_ADC_CTRL_CH_SEL_AIN3                     (MXC_V_ADC_CTRL_CH_SEL_AIN3 << MXC_F_ADC_CTRL_CH_SEL_POS) /**< CTRL_CH_SEL_AIN3 Setting */
#define MXC_V_ADC_CTRL_CH_SEL_AIN0_DIV5                ((uint32_t)0x4UL) /**< CTRL_CH_SEL_AIN0_DIV5 Value */
#define MXC_S_ADC_CTRL_CH_SEL_AIN0_DIV5                (MXC_V_ADC_CTRL_CH_SEL_AIN0_DIV5 << MXC_F_ADC_CTRL_CH_SEL_POS) /**< CTRL_CH_SEL_AIN0_DIV5 Setting */
#define MXC_V_ADC_CTRL_CH_SEL_AIN1_DIV5                ((uint32_t)0x5UL) /**< CTRL_CH_SEL_AIN1_DIV5 Value */
#define MXC_S_ADC_CTRL_CH_SEL_AIN1_DIV5                (MXC_V_ADC_CTRL_CH_SEL_AIN1_DIV5 << MXC_F_ADC_CTRL_CH_SEL_POS) /**< CTRL_CH_SEL_AIN1_DIV5 Setting */
#define MXC_V_ADC_CTRL_CH_SEL_VDDB_DIV4                ((uint32_t)0x6UL) /**< CTRL_CH_SEL_VDDB_DIV4 Value */
#define MXC_S_ADC_CTRL_CH_SEL_VDDB_DIV4                (MXC_V_ADC_CTRL_CH_SEL_VDDB_DIV4 << MXC_F_ADC_CTRL_CH_SEL_POS) /**< CTRL_CH_SEL_VDDB_DIV4 Setting */
#define MXC_V_ADC_CTRL_CH_SEL_VDDA                     ((uint32_t)0x7UL) /**< CTRL_CH_SEL_VDDA Value */
#define MXC_S_ADC_CTRL_CH_SEL_VDDA                     (MXC_V_ADC_CTRL_CH_SEL_VDDA << MXC_F_ADC_CTRL_CH_SEL_POS) /**< CTRL_CH_SEL_VDDA Setting */
#define MXC_V_ADC_CTRL_CH_SEL_VCORE                    ((uint32_t)0x8UL) /**< CTRL_CH_SEL_VCORE Value */
#define MXC_S_ADC_CTRL_CH_SEL_VCORE                    (MXC_V_ADC_CTRL_CH_SEL_VCORE << MXC_F_ADC_CTRL_CH_SEL_POS) /**< CTRL_CH_SEL_VCORE Setting */
#define MXC_V_ADC_CTRL_CH_SEL_VRTC_DIV2                ((uint32_t)0x9UL) /**< CTRL_CH_SEL_VRTC_DIV2 Value */
#define MXC_S_ADC_CTRL_CH_SEL_VRTC_DIV2                (MXC_V_ADC_CTRL_CH_SEL_VRTC_DIV2 << MXC_F_ADC_CTRL_CH_SEL_POS) /**< CTRL_CH_SEL_VRTC_DIV2 Setting */
#define MXC_V_ADC_CTRL_CH_SEL_RSV_0XA                  ((uint32_t)0xAUL) /**< CTRL_CH_SEL_RSV_0XA Value */
#define MXC_S_ADC_CTRL_CH_SEL_RSV_0XA                  (MXC_V_ADC_CTRL_CH_SEL_RSV_0XA << MXC_F_ADC_CTRL_CH_SEL_POS) /**< CTRL_CH_SEL_RSV_0XA Setting */
#define MXC_V_ADC_CTRL_CH_SEL_VDDIO_DIV4               ((uint32_t)0xBUL) /**< CTRL_CH_SEL_VDDIO_DIV4 Value */
#define MXC_S_ADC_CTRL_CH_SEL_VDDIO_DIV4               (MXC_V_ADC_CTRL_CH_SEL_VDDIO_DIV4 << MXC_F_ADC_CTRL_CH_SEL_POS) /**< CTRL_CH_SEL_VDDIO_DIV4 Setting */
#define MXC_V_ADC_CTRL_CH_SEL_VDDIOH_DIV4              ((uint32_t)0xCUL) /**< CTRL_CH_SEL_VDDIOH_DIV4 Value */
#define MXC_S_ADC_CTRL_CH_SEL_VDDIOH_DIV4              (MXC_V_ADC_CTRL_CH_SEL_VDDIOH_DIV4 << MXC_F_ADC_CTRL_CH_SEL_POS) /**< CTRL_CH_SEL_VDDIOH_DIV4 Setting */

#define MXC_F_ADC_CTRL_DATA_ALIGN_POS                  17 /**< CTRL_DATA_ALIGN Position */
#define MXC_F_ADC_CTRL_DATA_ALIGN                      ((uint32_t)(0x1UL << MXC_F_ADC_CTRL_DATA_ALIGN_POS)) /**< CTRL_DATA_ALIGN Mask */
#define MXC_V_ADC_CTRL_DATA_ALIGN_LSB_JUSTIFIED        ((uint32_t)0x0UL) /**< CTRL_DATA_ALIGN_LSB_JUSTIFIED Value */
#define MXC_S_ADC_CTRL_DATA_ALIGN_LSB_JUSTIFIED        (MXC_V_ADC_CTRL_DATA_ALIGN_LSB_JUSTIFIED << MXC_F_ADC_CTRL_DATA_ALIGN_POS) /**< CTRL_DATA_ALIGN_LSB_JUSTIFIED Setting */
#define MXC_V_ADC_CTRL_DATA_ALIGN_MSB_JUSTIFIED        ((uint32_t)0x1UL) /**< CTRL_DATA_ALIGN_MSB_JUSTIFIED Value */
#define MXC_S_ADC_CTRL_DATA_ALIGN_MSB_JUSTIFIED        (MXC_V_ADC_CTRL_DATA_ALIGN_MSB_JUSTIFIED << MXC_F_ADC_CTRL_DATA_ALIGN_POS) /**< CTRL_DATA_ALIGN_MSB_JUSTIFIED Setting */

