analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/adc_regs.h
/**@} end of group ADC_CTRL_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_STATUS ADC_STATUS
 * @brief    ADC Status
 * @{
 */
#define MXC_F_ADC_STATUS_ACTIVE_POS                    0 /**< STATUS_ACTIVE Position */
#define MXC_F_ADC_STATUS_ACTIVE                        ((uint32_t)(0x1UL << MXC_F_ADC_STATUS_ACTIVE_POS)) /**< STATUS_ACTIVE Mask */
#define MXC_V_ADC_STATUS_ACTIVE_IDLE                   ((uint32_t)0x0UL) /**< STATUS_ACTIVE_IDLE Value */
#define MXC_S_ADC_STATUS_ACTIVE_IDLE                   (MXC_V_ADC_STATUS_ACTIVE_IDLE << MXC_F_ADC_STATUS_ACTIVE_POS) /**< STATUS_ACTIVE_IDLE Setting */
#define MXC_V_ADC_STATUS_ACTIVE_ACTIVE                 ((uint32_t)0x1UL) /**< STATUS_ACTIVE_ACTIVE Value */
#define MXC_S_ADC_STATUS_ACTIVE_ACTIVE                 (MXC_V_ADC_STATUS_ACTIVE_ACTIVE << MXC_F_ADC_STATUS_ACTIVE_POS) /**< STATUS_ACTIVE_ACTIVE Setting */

#define MXC_F_ADC_STATUS_PWR_UP_ACTIVE_POS             2 /**< STATUS_PWR_UP_ACTIVE Position */
#define MXC_F_ADC_STATUS_PWR_UP_ACTIVE                 ((uint32_t)(0x1UL << MXC_F_ADC_STATUS_PWR_UP_ACTIVE_POS)) /**< STATUS_PWR_UP_ACTIVE Mask */
#define MXC_V_ADC_STATUS_PWR_UP_ACTIVE_NO_DELAY        ((uint32_t)0x0UL) /**< STATUS_PWR_UP_ACTIVE_NO_DELAY Value */
#define MXC_S_ADC_STATUS_PWR_UP_ACTIVE_NO_DELAY        (MXC_V_ADC_STATUS_PWR_UP_ACTIVE_NO_DELAY << MXC_F_ADC_STATUS_PWR_UP_ACTIVE_POS) /**< STATUS_PWR_UP_ACTIVE_NO_DELAY Setting */
#define MXC_V_ADC_STATUS_PWR_UP_ACTIVE_DELAY_ACTIVE    ((uint32_t)0x1UL) /**< STATUS_PWR_UP_ACTIVE_DELAY_ACTIVE Value */
#define MXC_S_ADC_STATUS_PWR_UP_ACTIVE_DELAY_ACTIVE    (MXC_V_ADC_STATUS_PWR_UP_ACTIVE_DELAY_ACTIVE << MXC_F_ADC_STATUS_PWR_UP_ACTIVE_POS) /**< STATUS_PWR_UP_ACTIVE_DELAY_ACTIVE Setting */

#define MXC_F_ADC_STATUS_OVERFLOW_POS                  3 /**< STATUS_OVERFLOW Position */
#define MXC_F_ADC_STATUS_OVERFLOW                      ((uint32_t)(0x1UL << MXC_F_ADC_STATUS_OVERFLOW_POS)) /**< STATUS_OVERFLOW Mask */
#define MXC_V_ADC_STATUS_OVERFLOW_UNDERFLOW            ((uint32_t)0x0UL) /**< STATUS_OVERFLOW_UNDERFLOW Value */
#define MXC_S_ADC_STATUS_OVERFLOW_UNDERFLOW            (MXC_V_ADC_STATUS_OVERFLOW_UNDERFLOW << MXC_F_ADC_STATUS_OVERFLOW_POS) /**< STATUS_OVERFLOW_UNDERFLOW Setting */
#define MXC_V_ADC_STATUS_OVERFLOW_OVERFLOW             ((uint32_t)0x1UL) /**< STATUS_OVERFLOW_OVERFLOW Value */
#define MXC_S_ADC_STATUS_OVERFLOW_OVERFLOW             (MXC_V_ADC_STATUS_OVERFLOW_OVERFLOW << MXC_F_ADC_STATUS_OVERFLOW_POS) /**< STATUS_OVERFLOW_OVERFLOW Setting */

/**@} end of group ADC_STATUS_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_DATA ADC_DATA
 * @brief    ADC Output Data
 * @{
 */
#define MXC_F_ADC_DATA_DATA_POS                        0 /**< DATA_DATA Position */
#define MXC_F_ADC_DATA_DATA                            ((uint32_t)(0xFFFFUL << MXC_F_ADC_DATA_DATA_POS)) /**< DATA_DATA Mask */

/**@} end of group ADC_DATA_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_INTR ADC_INTR
 * @brief    ADC Interrupt Control Register
 * @{
 */
#define MXC_F_ADC_INTR_DONE_IE_POS                     0 /**< INTR_DONE_IE Position */
#define MXC_F_ADC_INTR_DONE_IE                         ((uint32_t)(0x1UL << MXC_F_ADC_INTR_DONE_IE_POS)) /**< INTR_DONE_IE Mask */
#define MXC_V_ADC_INTR_DONE_IE_DIS                     ((uint32_t)0x0UL) /**< INTR_DONE_IE_DIS Value */
#define MXC_S_ADC_INTR_DONE_IE_DIS                     (MXC_V_ADC_INTR_DONE_IE_DIS << MXC_F_ADC_INTR_DONE_IE_POS) /**< INTR_DONE_IE_DIS Setting */
#define MXC_V_ADC_INTR_DONE_IE_EN                      ((uint32_t)0x1UL) /**< INTR_DONE_IE_EN Value */
#define MXC_S_ADC_INTR_DONE_IE_EN                      (MXC_V_ADC_INTR_DONE_IE_EN << MXC_F_ADC_INTR_DONE_IE_POS) /**< INTR_DONE_IE_EN Setting */

#define MXC_F_ADC_INTR_REF_READY_IE_POS                1 /**< INTR_REF_READY_IE Position */
#define MXC_F_ADC_INTR_REF_READY_IE                    ((uint32_t)(0x1UL << MXC_F_ADC_INTR_REF_READY_IE_POS)) /**< INTR_REF_READY_IE Mask */
#define MXC_V_ADC_INTR_REF_READY_IE_DIS                ((uint32_t)0x0UL) /**< INTR_REF_READY_IE_DIS Value */
#define MXC_S_ADC_INTR_REF_READY_IE_DIS                (MXC_V_ADC_INTR_REF_READY_IE_DIS << MXC_F_ADC_INTR_REF_READY_IE_POS) /**< INTR_REF_READY_IE_DIS Setting */
#define MXC_V_ADC_INTR_REF_READY_IE_EN                 ((uint32_t)0x1UL) /**< INTR_REF_READY_IE_EN Value */
#define MXC_S_ADC_INTR_REF_READY_IE_EN                 (MXC_V_ADC_INTR_REF_READY_IE_EN << MXC_F_ADC_INTR_REF_READY_IE_POS) /**< INTR_REF_READY_IE_EN Setting */

#define MXC_F_ADC_INTR_HI_LIMIT_IE_POS                 2 /**< INTR_HI_LIMIT_IE Position */
#define MXC_F_ADC_INTR_HI_LIMIT_IE                     ((uint32_t)(0x1UL << MXC_F_ADC_INTR_HI_LIMIT_IE_POS)) /**< INTR_HI_LIMIT_IE Mask */
#define MXC_V_ADC_INTR_HI_LIMIT_IE_DIS                 ((uint32_t)0x0UL) /**< INTR_HI_LIMIT_IE_DIS Value */
#define MXC_S_ADC_INTR_HI_LIMIT_IE_DIS                 (MXC_V_ADC_INTR_HI_LIMIT_IE_DIS << MXC_F_ADC_INTR_HI_LIMIT_IE_POS) /**< INTR_HI_LIMIT_IE_DIS Setting */
#define MXC_V_ADC_INTR_HI_LIMIT_IE_EN                  ((uint32_t)0x1UL) /**< INTR_HI_LIMIT_IE_EN Value */
#define MXC_S_ADC_INTR_HI_LIMIT_IE_EN                  (MXC_V_ADC_INTR_HI_LIMIT_IE_EN << MXC_F_ADC_INTR_HI_LIMIT_IE_POS) /**< INTR_HI_LIMIT_IE_EN Setting */

#define MXC_F_ADC_INTR_LO_LIMIT_IE_POS                 3 /**< INTR_LO_LIMIT_IE Position */
#define MXC_F_ADC_INTR_LO_LIMIT_IE                     ((uint32_t)(0x1UL << MXC_F_ADC_INTR_LO_LIMIT_IE_POS)) /**< INTR_LO_LIMIT_IE Mask */
#define MXC_V_ADC_INTR_LO_LIMIT_IE_DIS                 ((uint32_t)0x0UL) /**< INTR_LO_LIMIT_IE_DIS Value */
#define MXC_S_ADC_INTR_LO_LIMIT_IE_DIS                 (MXC_V_ADC_INTR_LO_LIMIT_IE_DIS << MXC_F_ADC_INTR_LO_LIMIT_IE_POS) /**< INTR_LO_LIMIT_IE_DIS Setting */
#define MXC_V_ADC_INTR_LO_LIMIT_IE_EN                  ((uint32_t)0x1UL) /**< INTR_LO_LIMIT_IE_EN Value */
#define MXC_S_ADC_INTR_LO_LIMIT_IE_EN                  (MXC_V_ADC_INTR_LO_LIMIT_IE_EN << MXC_F_ADC_INTR_LO_LIMIT_IE_POS) /**< INTR_LO_LIMIT_IE_EN Setting */

#define MXC_F_ADC_INTR_OVERFLOW_IE_POS                 4 /**< INTR_OVERFLOW_IE Position */
#define MXC_F_ADC_INTR_OVERFLOW_IE                     ((uint32_t)(0x1UL << MXC_F_ADC_INTR_OVERFLOW_IE_POS)) /**< INTR_OVERFLOW_IE Mask */
#define MXC_V_ADC_INTR_OVERFLOW_IE_DIS                 ((uint32_t)0x0UL) /**< INTR_OVERFLOW_IE_DIS Value */
#define MXC_S_ADC_INTR_OVERFLOW_IE_DIS                 (MXC_V_ADC_INTR_OVERFLOW_IE_DIS << MXC_F_ADC_INTR_OVERFLOW_IE_POS) /**< INTR_OVERFLOW_IE_DIS Setting */
#define MXC_V_ADC_INTR_OVERFLOW_IE_EN                  ((uint32_t)0x1UL) /**< INTR_OVERFLOW_IE_EN Value */
#define MXC_S_ADC_INTR_OVERFLOW_IE_EN                  (MXC_V_ADC_INTR_OVERFLOW_IE_EN << MXC_F_ADC_INTR_OVERFLOW_IE_POS) /**< INTR_OVERFLOW_IE_EN Setting */

#define MXC_F_ADC_INTR_DONE_IF_POS                     16 /**< INTR_DONE_IF Position */
#define MXC_F_ADC_INTR_DONE_IF                         ((uint32_t)(0x1UL << MXC_F_ADC_INTR_DONE_IF_POS)) /**< INTR_DONE_IF Mask */
#define MXC_V_ADC_INTR_DONE_IF_INACTIVE                ((uint32_t)0x0UL) /**< INTR_DONE_IF_INACTIVE Value */
#define MXC_S_ADC_INTR_DONE_IF_INACTIVE                (MXC_V_ADC_INTR_DONE_IF_INACTIVE << MXC_F_ADC_INTR_DONE_IF_POS) /**< INTR_DONE_IF_INACTIVE Setting */
#define MXC_V_ADC_INTR_DONE_IF_ACTIVE                  ((uint32_t)0x1UL) /**< INTR_DONE_IF_ACTIVE Value */
#define MXC_S_ADC_INTR_DONE_IF_ACTIVE                  (MXC_V_ADC_INTR_DONE_IF_ACTIVE << MXC_F_ADC_INTR_DONE_IF_POS) /**< INTR_DONE_IF_ACTIVE Setting */

#define MXC_F_ADC_INTR_REF_READY_IF_POS                17 /**< INTR_REF_READY_IF Position */
#define MXC_F_ADC_INTR_REF_READY_IF                    ((uint32_t)(0x1UL << MXC_F_ADC_INTR_REF_READY_IF_POS)) /**< INTR_REF_READY_IF Mask */
#define MXC_V_ADC_INTR_REF_READY_IF_INACTIVE           ((uint32_t)0x0UL) /**< INTR_REF_READY_IF_INACTIVE Value */
#define MXC_S_ADC_INTR_REF_READY_IF_INACTIVE           (MXC_V_ADC_INTR_REF_READY_IF_INACTIVE << MXC_F_ADC_INTR_REF_READY_IF_POS) /**< INTR_REF_READY_IF_INACTIVE Setting */
#define MXC_V_ADC_INTR_REF_READY_IF_ACTIVE             ((uint32_t)0x1UL) /**< INTR_REF_READY_IF_ACTIVE Value */
#define MXC_S_ADC_INTR_REF_READY_IF_ACTIVE             (MXC_V_ADC_INTR_REF_READY_IF_ACTIVE << MXC_F_ADC_INTR_REF_READY_IF_POS) /**< INTR_REF_READY_IF_ACTIVE Setting */

#define MXC_F_ADC_INTR_HI_LIMIT_IF_POS                 18 /**< INTR_HI_LIMIT_IF Position */
#define MXC_F_ADC_INTR_HI_LIMIT_IF                     ((uint32_t)(0x1UL << MXC_F_ADC_INTR_HI_LIMIT_IF_POS)) /**< INTR_HI_LIMIT_IF Mask */
#define MXC_V_ADC_INTR_HI_LIMIT_IF_INACTIVE            ((uint32_t)0x0UL) /**< INTR_HI_LIMIT_IF_INACTIVE Value */
#define MXC_S_ADC_INTR_HI_LIMIT_IF_INACTIVE            (MXC_V_ADC_INTR_HI_LIMIT_IF_INACTIVE << MXC_F_ADC_INTR_HI_LIMIT_IF_POS) /**< INTR_HI_LIMIT_IF_INACTIVE Setting */
#define MXC_V_ADC_INTR_HI_LIMIT_IF_ACTIVE              ((uint32_t)0x1UL) /**< INTR_HI_LIMIT_IF_ACTIVE Value */
#define MXC_S_ADC_INTR_HI_LIMIT_IF_ACTIVE              (MXC_V_ADC_INTR_HI_LIMIT_IF_ACTIVE << MXC_F_ADC_INTR_HI_LIMIT_IF_POS) /**< INTR_HI_LIMIT_IF_ACTIVE Setting */

#define MXC_F_ADC_INTR_LO_LIMIT_IF_POS                 19 /**< INTR_LO_LIMIT_IF Position */
#define MXC_F_ADC_INTR_LO_LIMIT_IF                     ((uint32_t)(0x1UL << MXC_F_ADC_INTR_LO_LIMIT_IF_POS)) /**< INTR_LO_LIMIT_IF Mask */
#define MXC_V_ADC_INTR_LO_LIMIT_IF_INACTIVE            ((uint32_t)0x0UL) /**< INTR_LO_LIMIT_IF_INACTIVE Value */
#define MXC_S_ADC_INTR_LO_LIMIT_IF_INACTIVE            (MXC_V_ADC_INTR_LO_LIMIT_IF_INACTIVE << MXC_F_ADC_INTR_LO_LIMIT_IF_POS) /**< INTR_LO_LIMIT_IF_INACTIVE Setting */
#define MXC_V_ADC_INTR_LO_LIMIT_IF_ACTIVE              ((uint32_t)0x1UL) /**< INTR_LO_LIMIT_IF_ACTIVE Value */
#define MXC_S_ADC_INTR_LO_LIMIT_IF_ACTIVE              (MXC_V_ADC_INTR_LO_LIMIT_IF_ACTIVE << MXC_F_ADC_INTR_LO_LIMIT_IF_POS) /**< INTR_LO_LIMIT_IF_ACTIVE Setting */

#define MXC_F_ADC_INTR_OVERFLOW_IF_POS                 20 /**< INTR_OVERFLOW_IF Position */
#define MXC_F_ADC_INTR_OVERFLOW_IF                     ((uint32_t)(0x1UL << MXC_F_ADC_INTR_OVERFLOW_IF_POS)) /**< INTR_OVERFLOW_IF Mask */
#define MXC_V_ADC_INTR_OVERFLOW_IF_INACTIVE            ((uint32_t)0x0UL) /**< INTR_OVERFLOW_IF_INACTIVE Value */
#define MXC_S_ADC_INTR_OVERFLOW_IF_INACTIVE            (MXC_V_ADC_INTR_OVERFLOW_IF_INACTIVE << MXC_F_ADC_INTR_OVERFLOW_IF_POS) /**< INTR_OVERFLOW_IF_INACTIVE Setting */
#define MXC_V_ADC_INTR_OVERFLOW_IF_ACTIVE              ((uint32_t)0x1UL) /**< INTR_OVERFLOW_IF_ACTIVE Value */
#define MXC_S_ADC_INTR_OVERFLOW_IF_ACTIVE              (MXC_V_ADC_INTR_OVERFLOW_IF_ACTIVE << MXC_F_ADC_INTR_OVERFLOW_IF_POS) /**< INTR_OVERFLOW_IF_ACTIVE Setting */

#define MXC_F_ADC_INTR_PENDING_POS                     22 /**< INTR_PENDING Position */
#define MXC_F_ADC_INTR_PENDING                         ((uint32_t)(0x1UL << MXC_F_ADC_INTR_PENDING_POS)) /**< INTR_PENDING Mask */
#define MXC_V_ADC_INTR_PENDING_NO_INT                  ((uint32_t)0x0UL) /**< INTR_PENDING_NO_INT Value */
#define MXC_S_ADC_INTR_PENDING_NO_INT                  (MXC_V_ADC_INTR_PENDING_NO_INT << MXC_F_ADC_INTR_PENDING_POS) /**< INTR_PENDING_NO_INT Setting */
#define MXC_V_ADC_INTR_PENDING_INT_PENDING             ((uint32_t)0x1UL) /**< INTR_PENDING_INT_PENDING Value */
#define MXC_S_ADC_INTR_PENDING_INT_PENDING             (MXC_V_ADC_INTR_PENDING_INT_PENDING << MXC_F_ADC_INTR_PENDING_POS) /**< INTR_PENDING_INT_PENDING Setting */

/**@} end of group ADC_INTR_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_LIMIT ADC_LIMIT
 * @brief    ADC Limit
 * @{
 */
#define MXC_F_ADC_LIMIT_CH_LO_LIMIT_POS                0 /**< LIMIT_CH_LO_LIMIT Position */
#define MXC_F_ADC_LIMIT_CH_LO_LIMIT                    ((uint32_t)(0x3FFUL << MXC_F_ADC_LIMIT_CH_LO_LIMIT_POS)) /**< LIMIT_CH_LO_LIMIT Mask */

#define MXC_F_ADC_LIMIT_CH_HI_LIMIT_POS                12 /**< LIMIT_CH_HI_LIMIT Position */
#define MXC_F_ADC_LIMIT_CH_HI_LIMIT                    ((uint32_t)(0x3FFUL << MXC_F_ADC_LIMIT_CH_HI_LIMIT_POS)) /**< LIMIT_CH_HI_LIMIT Mask */

#define MXC_F_ADC_LIMIT_CH_SEL_POS                     24 /**< LIMIT_CH_SEL Position */
#define MXC_F_ADC_LIMIT_CH_SEL                         ((uint32_t)(0xFUL << MXC_F_ADC_LIMIT_CH_SEL_POS)) /**< LIMIT_CH_SEL Mask */
#define MXC_V_ADC_LIMIT_CH_SEL_AIN0                    ((uint32_t)0x0UL) /**< LIMIT_CH_SEL_AIN0 Value */
#define MXC_S_ADC_LIMIT_CH_SEL_AIN0                    (MXC_V_ADC_LIMIT_CH_SEL_AIN0 << MXC_F_ADC_LIMIT_CH_SEL_POS) /**< LIMIT_CH_SEL_AIN0 Setting */
#define MXC_V_ADC_LIMIT_CH_SEL_AIN1                    ((uint32_t)0x1UL) /**< LIMIT_CH_SEL_AIN1 Value */
#define MXC_S_ADC_LIMIT_CH_SEL_AIN1                    (MXC_V_ADC_LIMIT_CH_SEL_AIN1 << MXC_F_ADC_LIMIT_CH_SEL_POS) /**< LIMIT_CH_SEL_AIN1 Setting */
#define MXC_V_ADC_LIMIT_CH_SEL_AIN2                    ((uint32_t)0x2UL) /**< LIMIT_CH_SEL_AIN2 Value */
#define MXC_S_ADC_LIMIT_CH_SEL_AIN2                    (MXC_V_ADC_LIMIT_CH_SEL_AIN2 << MXC_F_ADC_LIMIT_CH_SEL_POS) /**< LIMIT_CH_SEL_AIN2 Setting */
#define MXC_V_ADC_LIMIT_CH_SEL_AIN3                    ((uint32_t)0x3UL) /**< LIMIT_CH_SEL_AIN3 Value */
#define MXC_S_ADC_LIMIT_CH_SEL_AIN3                    (MXC_V_ADC_LIMIT_CH_SEL_AIN3 << MXC_F_ADC_LIMIT_CH_SEL_POS) /**< LIMIT_CH_SEL_AIN3 Setting */
#define MXC_V_ADC_LIMIT_CH_SEL_AIN4                    ((uint32_t)0x4UL) /**< LIMIT_CH_SEL_AIN4 Value */
#define MXC_S_ADC_LIMIT_CH_SEL_AIN4                    (MXC_V_ADC_LIMIT_CH_SEL_AIN4 << MXC_F_ADC_LIMIT_CH_SEL_POS) /**< LIMIT_CH_SEL_AIN4 Setting */
#define MXC_V_ADC_LIMIT_CH_SEL_AIN5                    ((uint32_t)0x5UL) /**< LIMIT_CH_SEL_AIN5 Value */
#define MXC_S_ADC_LIMIT_CH_SEL_AIN5                    (MXC_V_ADC_LIMIT_CH_SEL_AIN5 << MXC_F_ADC_LIMIT_CH_SEL_POS) /**< LIMIT_CH_SEL_AIN5 Setting */
#define MXC_V_ADC_LIMIT_CH_SEL_AIN6                    ((uint32_t)0x6UL) /**< LIMIT_CH_SEL_AIN6 Value */
#define MXC_S_ADC_LIMIT_CH_SEL_AIN6                    (MXC_V_ADC_LIMIT_CH_SEL_AIN6 << MXC_F_ADC_LIMIT_CH_SEL_POS) /**< LIMIT_CH_SEL_AIN6 Setting */
#define MXC_V_ADC_LIMIT_CH_SEL_AIN7                    ((uint32_t)0x7UL) /**< LIMIT_CH_SEL_AIN7 Value */
#define MXC_S_ADC_LIMIT_CH_SEL_AIN7                    (MXC_V_ADC_LIMIT_CH_SEL_AIN7 << MXC_F_ADC_LIMIT_CH_SEL_POS) /**< LIMIT_CH_SEL_AIN7 Setting */
#define MXC_V_ADC_LIMIT_CH_SEL_AIN8                    ((uint32_t)0x8UL) /**< LIMIT_CH_SEL_AIN8 Value */
#define MXC_S_ADC_LIMIT_CH_SEL_AIN8                    (MXC_V_ADC_LIMIT_CH_SEL_AIN8 << MXC_F_ADC_LIMIT_CH_SEL_POS) /**< LIMIT_CH_SEL_AIN8 Setting */
#define MXC_V_ADC_LIMIT_CH_SEL_AIN9                    ((uint32_t)0x9UL) /**< LIMIT_CH_SEL_AIN9 Value */
#define MXC_S_ADC_LIMIT_CH_SEL_AIN9                    (MXC_V_ADC_LIMIT_CH_SEL_AIN9 << MXC_F_ADC_LIMIT_CH_SEL_POS) /**< LIMIT_CH_SEL_AIN9 Setting */
#define MXC_V_ADC_LIMIT_CH_SEL_AIN10                   ((uint32_t)0xAUL) /**< LIMIT_CH_SEL_AIN10 Value */
#define MXC_S_ADC_LIMIT_CH_SEL_AIN10                   (MXC_V_ADC_LIMIT_CH_SEL_AIN10 << MXC_F_ADC_LIMIT_CH_SEL_POS) /**< LIMIT_CH_SEL_AIN10 Setting */
#define MXC_V_ADC_LIMIT_CH_SEL_AIN11                   ((uint32_t)0xBUL) /**< LIMIT_CH_SEL_AIN11 Value */
#define MXC_S_ADC_LIMIT_CH_SEL_AIN11                   (MXC_V_ADC_LIMIT_CH_SEL_AIN11 << MXC_F_ADC_LIMIT_CH_SEL_POS) /**< LIMIT_CH_SEL_AIN11 Setting */
#define MXC_V_ADC_LIMIT_CH_SEL_AIN12                   ((uint32_t)0xCUL) /**< LIMIT_CH_SEL_AIN12 Value */
#define MXC_S_ADC_LIMIT_CH_SEL_AIN12                   (MXC_V_ADC_LIMIT_CH_SEL_AIN12 << MXC_F_ADC_LIMIT_CH_SEL_POS) /**< LIMIT_CH_SEL_AIN12 Setting */

#define MXC_F_ADC_LIMIT_CH_LO_LIMIT_EN_POS             28 /**< LIMIT_CH_LO_LIMIT_EN Position */
#define MXC_F_ADC_LIMIT_CH_LO_LIMIT_EN                 ((uint32_t)(0x1UL << MXC_F_ADC_LIMIT_CH_LO_LIMIT_EN_POS)) /**< LIMIT_CH_LO_LIMIT_EN Mask */
#define MXC_V_ADC_LIMIT_CH_LO_LIMIT_EN_DIS             ((uint32_t)0x0UL) /**< LIMIT_CH_LO_LIMIT_EN_DIS Value */
#define MXC_S_ADC_LIMIT_CH_LO_LIMIT_EN_DIS             (MXC_V_ADC_LIMIT_CH_LO_LIMIT_EN_DIS << MXC_F_ADC_LIMIT_CH_LO_LIMIT_EN_POS) /**< LIMIT_CH_LO_LIMIT_EN_DIS Setting */
#define MXC_V_ADC_LIMIT_CH_LO_LIMIT_EN_EN              ((uint32_t)0x1UL) /**< LIMIT_CH_LO_LIMIT_EN_EN Value */
#define MXC_S_ADC_LIMIT_CH_LO_LIMIT_EN_EN              (MXC_V_ADC_LIMIT_CH_LO_LIMIT_EN_EN << MXC_F_ADC_LIMIT_CH_LO_LIMIT_EN_POS) /**< LIMIT_CH_LO_LIMIT_EN_EN Setting */

#define MXC_F_ADC_LIMIT_CH_HI_LIMIT_EN_POS             29 /**< LIMIT_CH_HI_LIMIT_EN Position */
#define MXC_F_ADC_LIMIT_CH_HI_LIMIT_EN                 ((uint32_t)(0x1UL << MXC_F_ADC_LIMIT_CH_HI_LIMIT_EN_POS)) /**< LIMIT_CH_HI_LIMIT_EN Mask */
#define MXC_V_ADC_LIMIT_CH_HI_LIMIT_EN_DIS             ((uint32_t)0x0UL) /**< LIMIT_CH_HI_LIMIT_EN_DIS Value */
#define MXC_S_ADC_LIMIT_CH_HI_LIMIT_EN_DIS             (MXC_V_ADC_LIMIT_CH_HI_LIMIT_EN_DIS << MXC_F_ADC_LIMIT_CH_HI_LIMIT_EN_POS) /**< LIMIT_CH_HI_LIMIT_EN_DIS Setting */
#define MXC_V_ADC_LIMIT_CH_HI_LIMIT_EN_EN              ((uint32_t)0x1UL) /**< LIMIT_CH_HI_LIMIT_EN_EN Value */
#define MXC_S_ADC_LIMIT_CH_HI_LIMIT_EN_EN              (MXC_V_ADC_LIMIT_CH_HI_LIMIT_EN_EN << MXC_F_ADC_LIMIT_CH_HI_LIMIT_EN_POS) /**< LIMIT_CH_HI_LIMIT_EN_EN Setting */

/**@} end of group ADC_LIMIT_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_ADC_REGS_H_
